test-api/stress-tests/summary_1.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,KB/sec,Avg. Bytes
ChargesBy,100,3692,494,16943,3512.67,0.00%,4.2,3.14,757.0
PassesCost,100,3096,34,16319,3118.10,0.00%,4.3,1.77,418.0
PassesAnalysis,100,2537,22,15406,2544.23,0.00%,4.4,4.62,1080.0
PassesPerStation,100,2138,20,10583,2082.79,0.00%,4.4,9.99,2300.0
TOTAL,400,2865,20,16943,2926.01,0.00%,16.9,18.80,1138.8